# Usage:
#   $ brew bundle cleanup
#   $ brew bundle
#
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"

# cli
brew "screen"
brew "wget"
brew "zsh"
brew "neovim"
brew "nkf"
brew "curl"
brew 'direnv'
brew "git"
brew "youtube-dl"


# for dev
brew "pre-commit"
brew "rbenv"
brew "nodenv"
brew "yarn"
brew "shared-mime-info"
brew "awscli"
brew "coreutils"
brew "jq"
brew "shellcheck"
brew "shfmt"
brew "ripgrep"


# middleware
brew "mysql"
brew "redis"


# cask
cask "coteditor"
cask "firefox"
cask "google-chrome"
cask "karabiner-elements"
cask "discord"
cask "docker"
cask "font-hack-nerd-font"
# cask "parsec"
cask "vlc"
cask "slack"
cask "1password"
cask "google-cloud-sdk"
cask "raspberry-pi-imager"
cask "zoom"
