tap "homebrew/bundle"
brew "coreutils"
brew "jq"
brew "rbenv"
brew "screen"
brew "vim"
brew "wget"
brew "zsh"
brew "neovim"
brew "redis"
brew "mysql"
brew "awscli"
brew "nkf"
brew "curl"
brew "rbenv"
brew "nodenv"

cask "coteditor"
cask "firefox"
cask "google-chrome"
cask "karabiner-elements"
cask "skitch"
