# Usage:
#   $ brew bundle cleanup
#   $ brew bundle
#
tap "homebrew/bundle"

# cli
brew "screen"
brew "wget"
brew "zsh"
brew "neovim"
brew "nkf"
brew "curl"
brew 'direnv'


# for dev
brew "ruby-completion"
brew "gem-completion"
brew "bundler-completion"
brew "rails-completion"
brew "pre-commit"
brew "rbenv"
brew "nodenv"
brew "yarn"
brew "shared-mime-info"
brew "awscli"
brew "coreutils"
brew "jq"


# middleware
brew "mysql"
brew "redis"


# cask
cask "coteditor"
cask "firefox"
cask "google-chrome"
cask "karabiner-elements"
cask "discord"
cask "docker"
cask "parsec"
cask "vlc"
cask "slack"
cask "1password"
